<?php
namespace Yaoqi\Fuyou\Service;
class ErrorMessage
{


    public static $err = array(
        //交易结果
        "0000" => "操作成功",
        "1111" => "权限不足",
        "9999" => "系统内部异常",
        "9998" => "连接外部系统异常",
        "9111" => "权限不足,请先授权之后再进行操作",
        "9997" => "系统连接事变",
        //交易校验
        "0010" => "未找到用户信息",
        "0011" => "找到多个相同的用户信息",
        "0012" => "用户信息已注册",
        "0013" => "商户号与用户ID不匹配",
        "0014" => "用户信息不完整",
        "0015" => "银行卡号不合法",
        "0016" => "商户机构号不存在",
        "0017" => "商户号不存在或者为关闭状态",
        "0018" => "银行信息不正确",
        "0019" => "开户失败",
        "0020" => "添加用户信息到数据库失败",
        "0121" => "添加用户过程异常",
        "0122" => "分账商户未找到主账户",
        "0123" => "身份证号与姓名不匹配",
        "0124" => "不能使用贷记卡开户",
        "0125" => "未查到卡的卡bin",
        "0126" => "银行卡号与银行不匹配",
        "0127" => "用户类型不合法",
        "0128" => "用户更新失败",
        "0020" => "提现失败",
        "0023" => "提现验证码不对",
        "0031" => "未找到分账规则",
        "0032" => "分账规则状态非审核通过",
        "0033" => "分账规则详细信息未找到",
        "0034" => "入账户未匹配到",
        "0035" => "规则添加失败",
        "0036" => "规则更新失败",
        "0037" => "规则查询失败",
        "0038" => "未找到分账规则",
        "0039" => "分账规则不能空",
        "0339" => "该订单不支持分账",
        "0340" => "分账规则与交易订单的分账规则不一致",
        "0341" => "分账规则不适用于此类型交易",
        "0342" => "分账规则未找到生效时间",
        "0343" => "分账规则已经过期",
        "0040" => "交易未支付",
        "0041" => "可用余额不足",
        "0042" => "查询用户数量过多",
        "0043" => "只能查自己商户下面的用户余额",
        "0044" => "原支付订单号不为空时,支付类型为必填",
        "0062" => "未找到支付原交易",
        "0063" => "直接分账订单,分账规则编号不能为空",
        "0601" => "线下进件审核状态",
        "0602" => "终端状态不可用",
        "0603" => "ftp连接异常",
        "0604" => "线下交易功能未开通",
        "5000" => "参数不合法",
        //签名
        "6000" => "签名验证失败",
        "6001" => "获取商户RSA公钥失败",
        "6002" => "获取商户RSA私钥失败",
        "6003" => "生成签名信息失败",
        //分账校验
        "1001" => "原交易订单异常",
        "1002" => "原交易订单已经分账",
        "1003" => "原交易订单已经退款",
        "1004" => "分账部分成功,待系统人员处理之后确认",
        "1005" => "转账部分成功,待系统人员处理之后确认",
        "1006" => "微信/支付宝支持30天内的订单进行退款",
        "1007" => "订单金额与原订单不匹配",
        "1008" => "退款金额大于交易金额",
        "1009" => "部分退款的金额不能和订单金额相同",
        "1010" => "整单退款的金额必须和订单金额相同",
        "2001" => "交易处理中",
        //重复交易
        "2002" => "交易已经完成,请查询交易状态",
        //分账
        "7000" => "分账失败",
        //转账
        "9000" => "转账失败",
        //提现
        "8000" => "提现密码有误",
        "2021" => "提现受理成功",
        "2022" => "提现失败,具体失败原因",
        "2023" => "提现,划款失败,已退回",
        //解冻
        "0021" => "冻结,失败",
        //解冻
        "0022" => "解冻,失败",
        //充值
        "0050" => "",
        //微信支付
        "0060" => "微信支付异常",
    );
    public static function checkError($error)
    {
        if (self::$err[$error] != "0000") {
            return true;
        }
        return self::$err[$error];
    }
}
